/*** 範例10.5.1.A(UART範例-1 for UNO_A) ***/
#define ButtonPin 5     //指定按鈕接腳

/***************************************************
 * setup
 ***************************************************/
void setup() {
  Serial.begin(9600);   //設定串列埠傳輸速率為9600 bps
  pinMode(ButtonPin,INPUT_PULLUP);
}

/***************************************************
 * loop
 ***************************************************/
void loop() {
  if(digitalRead(ButtonPin)==LOW) {
    Serial.write('1');  //按鈕開關按下，送出1
    delay(200);         //適當延遲，避免連續觸發
  }
}
