/*** 範例12.4.2.B(SPI範例-2 for UNO_B) ***/
#include <SPI.h>

/***************************************************
 * setup
 ***************************************************/
void setup () {
  Serial.begin(9600);    //設定串列埠傳輸速率為9600 bps
  pinMode(MISO,OUTPUT);  //設定MISO接腳為OUTPUT
  SPCR |= _BV(SPE);      //啟用SPI在slave模式
  SPI.attachInterrupt(); //啟用SPI中斷
}

/***************************************************
 * loop
 ***************************************************/
void loop() {
  //empty
}

/***************************************************
 * SPI傳輸完成中斷服務程式
 ***************************************************/
ISR(SPI_STC_vect) {
  byte value=SPDR;        //從SPI資料暫存器SPDR抓取數值
  Serial.println(value);  //印出數值
}
